; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=88, remove_proportion=0.101, bases=35, instance_id=27, output=./training, seed=68

(define (problem warehouse-27)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 box50 box51 box52 box53 box54 box55 box56 box57 box58 box59 box60 box61 box62 box63 box64 box65 box66 box67 box68 box69 box70 box71 box72 box73 box74 box75 box76 box77 box78 box79 box80 box81 box82 box83 box84 box85 box86 box87 box88 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 base20 base21 base22 base23 base24 base25 base26 base27 base28 base29 base30 base31 base32 base33 base34 base35 - base
    )
    (:init
        (to-remove box15)
        (to-remove box32)
        (to-remove box56)
        (to-remove box60)
        (to-remove box61)
        (to-remove box65)
        (to-remove box75)
        (to-remove box78)
        (clear box17)
        (on box17 box30)
        (on box30 box63)
        (on-base box63 base1)
        (clear box25)
        (on box25 box64)
        (on box64 box80)
        (on-base box80 base2)
        (clear box45)
        (on box45 box7)
        (on box7 box44)
        (on-base box44 base3)
        (clear box12)
        (on-base box12 base4)
        (clear box76)
        (on-base box76 base5)
        (clear box34)
        (on box34 box13)
        (on box13 box50)
        (on-base box50 base6)
        (clear box88)
        (on box88 box66)
        (on box66 box10)
        (on-base box10 base7)
        (clear box6)
        (on box6 box74)
        (on box74 box75)
        (on box75 box29)
        (on box29 box40)
        (on-base box40 base8)
        (clear box24)
        (on box24 box82)
        (on-base box82 base9)
        (clear box26)
        (on box26 box28)
        (on-base box28 base10)
        (clear box5)
        (on box5 box48)
        (on-base box48 base11)
        (clear box43)
        (on box43 box14)
        (on box14 box78)
        (on-base box78 base12)
        (clear box15)
        (on box15 box35)
        (on box35 box16)
        (on-base box16 base13)
        (clear box68)
        (on box68 box70)
        (on-base box70 base14)
        (clear-base base15)
        (clear box54)
        (on box54 box49)
        (on-base box49 base16)
        (clear box53)
        (on box53 box69)
        (on box69 box1)
        (on box1 box41)
        (on-base box41 base17)
        (clear box77)
        (on-base box77 base18)
        (clear box33)
        (on box33 box81)
        (on-base box81 base19)
        (clear box62)
        (on box62 box73)
        (on-base box73 base20)
        (clear-base base21)
        (clear box11)
        (on box11 box2)
        (on box2 box86)
        (on-base box86 base22)
        (clear box87)
        (on box87 box79)
        (on box79 box52)
        (on box52 box71)
        (on box71 box27)
        (on box27 box51)
        (on-base box51 base23)
        (clear box4)
        (on-base box4 base24)
        (clear box22)
        (on box22 box61)
        (on box61 box47)
        (on box47 box56)
        (on box56 box38)
        (on box38 box32)
        (on-base box32 base25)
        (clear-base base26)
        (clear box42)
        (on box42 box46)
        (on box46 box39)
        (on-base box39 base27)
        (clear box84)
        (on box84 box36)
        (on box36 box37)
        (on box37 box19)
        (on-base box19 base28)
        (clear box67)
        (on box67 box3)
        (on box3 box20)
        (on-base box20 base29)
        (clear box57)
        (on box57 box83)
        (on box83 box58)
        (on-base box58 base30)
        (clear box60)
        (on box60 box72)
        (on box72 box55)
        (on box55 box31)
        (on box31 box9)
        (on-base box9 base31)
        (clear-base base32)
        (clear box59)
        (on-base box59 base33)
        (clear box18)
        (on box18 box65)
        (on box65 box23)
        (on-base box23 base34)
        (clear box21)
        (on box21 box85)
        (on box85 box8)
        (on-base box8 base35)
    )
    (:goal (and 
        (removed box15)
        (removed box32)
        (removed box56)
        (removed box60)
        (removed box61)
        (removed box65)
        (removed box75)
        (removed box78)
    ))
)

; plan
1. (move box18 box65 box11)
   deleted: (clear box11) (on box18 box65)
   added: (on box18 box11) (clear box65)
   goals met: 0 of 8
2. (move box22 box61 box12)
   deleted: (clear box12) (on box22 box61)
   added: (on box22 box12) (clear box61)
   goals met: 0 of 8
3. (remove box15 box35)
   deleted: (on box15 box35) (clear box15)
   added: (removed box15) (clear box35)
   goals met: 1 of 8
4. (move box43 box14 box17)
   deleted: (clear box17) (on box43 box14)
   added: (on box43 box17) (clear box14)
   goals met: 1 of 8
5. (move box14 box78 box18)
   deleted: (clear box18) (on box14 box78)
   added: (on box14 box18) (clear box78)
   goals met: 1 of 8
6. (move box6 box74 box14)
   deleted: (clear box14) (on box6 box74)
   added: (on box6 box14) (clear box74)
   goals met: 1 of 8
7. (move box74 box75 box21)
   deleted: (clear box21) (on box74 box75)
   added: (on box74 box21) (clear box75)
   goals met: 1 of 8
8. (remove box60 box72)
   deleted: (on box60 box72) (clear box60)
   added: (removed box60) (clear box72)
   goals met: 2 of 8
9. (remove box61 box47)
   deleted: (on box61 box47) (clear box61)
   added: (removed box61) (clear box47)
   goals met: 3 of 8
10. (move box47 box56 box22)
   deleted: (clear box22) (on box47 box56)
   added: (on box47 box22) (clear box56)
   goals met: 3 of 8
11. (remove box56 box38)
   deleted: (on box56 box38) (clear box56)
   added: (removed box56) (clear box38)
   goals met: 4 of 8
12. (move box38 box32 box24)
   deleted: (clear box24) (on box38 box32)
   added: (on box38 box24) (clear box32)
   goals met: 4 of 8
13. (remove-from-base box32 base25)
   deleted: (on-base box32 base25) (clear box32)
   added: (removed box32) (clear-base base25)
   goals met: 5 of 8
14. (remove box65 box23)
   deleted: (on box65 box23) (clear box65)
   added: (removed box65) (clear box23)
   goals met: 6 of 8
15. (remove box75 box29)
   deleted: (on box75 box29) (clear box75)
   added: (removed box75) (clear box29)
   goals met: 7 of 8
16. (remove-from-base box78 base12)
   deleted: (on-base box78 base12) (clear box78)
   added: (removed box78) (clear-base base12)
   goals met: 8 of 8
